tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "anyenv"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "automake"
brew "awscli"
brew "mas"
cask "alt-tab"
cask "appcleaner"
cask "cheatsheet"
cask "day-o"
cask "hyper"
cask "keyboardcleantool"
cask "meetingbar"
cask "r"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Menubar Countdown", id: 1485343244
mas "Microsoft Remote Desktop", id: 1295203466
mas "Xcode", id: 497799835
