tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "aom"
brew "apr"
brew "apr-util"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "automake"
brew "bat"
brew "direnv"
brew "exa"
brew "gh"
brew "mas"
brew "zplug"
brew "kubectx"
# cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "balenaetcher"
cask "cheatsheet"
cask "day-o"
cask "fig"
cask "font-meslo-lg-nerd-font"
# cask "github"
# cask "gitify"
cask "google-japanese-ime"
cask "hyper"
cask "keyboardcleantool"
cask "meetingbar"
cask "r"
# cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Menubar Countdown", id: 1485343244
mas "Xcode", id: 497799835
