tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "aom"
brew "apr-util"
brew "argon2"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "asdf"
brew "aspell"
brew "bat"
brew "chezmoi"
brew "curl"
brew "direnv"
brew "exa"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "srt"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "jq"
brew "kubectx"
brew "mas"
brew "nodebrew"
brew "openssl@1.1"
brew "terraform"
brew "tree"
brew "zplug"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "zsh-syntax-highlighting"
cask "1password"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "background-music"
cask "balenaetcher"
cask "cheatsheet"
cask "day-o"
cask "deepl"
cask "fig"
cask "font-meslo-lg-nerd-font"
cask "github"
cask "google-japanese-ime"
cask "hyper"
cask "keyboardcleantool"
cask "notion"
cask "r"
cask "slack"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Jira", id: 1475897096
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Menubar Countdown", id: 1485343244
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Xcode", id: 497799835
vscode "dataform.dataform"
vscode "DavidAnson.vscode-markdownlint"
vscode "dvirtz.parquet-viewer"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "eriklynd.json-tools"
vscode "fabiospampinato.vscode-diff"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "mechatroner.rainbow-csv"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "msysyamamoto.vscode-digdag"
vscode "oderwat.indent-rainbow"
vscode "PascalReitermann93.vscode-yaml-sort"
vscode "redhat.vscode-yaml"
vscode "shinichi-takii.sql-bigquery"
vscode "svsool.markdown-memo"
vscode "yzhang.markdown-all-in-one"
