tap "adoptopenjdk/openjdk"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "kpherox/personal"
tap "rcmdnk/file"
tap "sanemat/font"
tap "wata727/tflint"
brew "anyenv"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bison"
brew "bundler-completion"
brew "bzip2"
brew "cmake"
brew "composer"
brew "coreutils"
brew "curl"
brew "diffutils"
brew "django-completion"
brew "ed", link: true
brew "editorconfig"
brew "ffmpeg"
brew "figlet"
brew "findutils"
brew "gawk"
brew "gcc"
brew "gem-completion"
brew "gh"
brew "git-flow"
brew "git-lfs"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "googler"
brew "grep"
brew "grunt-completion"
brew "gzip"
brew "htop"
brew "httpd", restart_service: true
brew "hugo"
brew "icu4c"
brew "jpeg"
brew "jq"
brew "kitchen-completion"
brew "krb5"
brew "lha"
brew "libedit"
brew "libiconv"
brew "libpng"
brew "libxml2"
brew "libzip"
brew "lua"
brew "mas"
brew "mysql", restart_service: true
brew "mysql@5.7", restart_service: true
brew "node"
brew "oniguruma"
brew "openapi-generator"
brew "openjdk"
brew "openssl@1.1"
brew "openssl@3"
brew "parallel"
brew "pcre2"
brew "pip-completion"
brew "pkg-config"
brew "protobuf"
brew "q"
brew "rails-completion"
brew "rake-completion"
brew "rcmdnk/file/brew-file"
brew "re2c"
brew "ruby-completion"
brew "sanemat/font/ricty", args: ["with-powerline"]
brew "swagger-codegen"
brew "terminal-notifier"
brew "terraform-docs"
brew "tflint"
brew "tidy-html5"
brew "tmux"
brew "trash"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "yarn"
brew "zlib"
cask "adoptopenjdk8"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "cheatsheet"
cask "day-o"
cask "docker"
cask "font-hack-nerd-font"
cask "font-hackgen-nerd"
cask "hyper"
cask "java"
cask "keyboardcleantool"
cask "kindle"
cask "lastfm"
cask "meetingbar"
cask "ngrok"
cask "pock"
cask "provisionql"
cask "r"
cask "slack"
cask "visual-studio-code"
cask "xquartz"
cask "zoom"
mas "LINE", id: 539883307
mas "Microsoft Remote Desktop", id: 1295203466
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835

